digital-codes/ten-vad/examples_esp32/sdkconfig.defaults
# ESP32-S3 Configuration for TEN VAD

# Target Configuration
CONFIG_IDF_TARGET="esp32s3"

# PSRAM Configuration - 8MB PSRAM support
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Memory allocation strategy - use PSRAM for large allocations
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# FreeRTOS Configuration - important for PSRAM
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

# Main task stack size (increase for VAD processing)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Enable C++ standard library
CONFIG_NEWLIB_NANO_FORMAT=n

# Serial console configuration
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
